app/controllers/applied_for_controller.rb

SELECT "jseekers".* FROM "jseekers" WHERE "jseekers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def create
        @jseeker = Jseeker.find(session[:jseeker_id])

        @job=Job.find(params[:id])



        if AppliedFor.where(jseeker_id:@jseeker.id, job_id:@job).present?