app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_current_user
        if session[:user_id]
            @user = User.find_by(id:session[:user_id])
            Current.user = User.find_by(id:session[:user_id])

SELECT "jseekers".* FROM "jseekers" WHERE "jseekers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def set_current_jseeker
        if session[:jseeker_id]
            @jseeker = Jseeker.find_by(id:session[:jseeker_id])
            Current.jseeker = Jseeker.find_by(id:session[:jseeker_id])