app/controllers/applied_for_controller.rb

    def create
        @jseeker = Jseeker.find(session[:jseeker_id])

        @job=Job.find(params[:id])

        if AppliedFor.where(jseeker_id:@jseeker.id, job_id:@job).present?
            redirect_to jseeker_path(@jseeker), notice: "Already Applied"
        else
            @a = AppliedFor.new(job_id: @job.id, jseeker_id:@jseeker.id ,status: "1")
            if @a.save
---
SELECT "jseekers".* FROM "jseekers" WHERE "jseekers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "applied_fors".* FROM "applied_fors" WHERE "applied_fors"."jseeker_id" = ? AND "applied_fors"."job_id" = ?  [["jseeker_id", 7], ["job_id", 1]]
INSERT INTO "applied_fors" ("status", "job_id", "jseeker_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["status", 1], ["job_id", 4], ["jseeker_id", 4], ["created_at", "2021-11-24 16:51:16.072680"], ["updated_at", "2021-11-24 16:51:16.072680"]]

    def edit
        @job = Job.find(params[:job_id])
        @user = User.find(session[:user_id])
        @applied_for = AppliedFor.find(params[:id])
        @applied_for.status = "2"
        if @applied_for.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "applied_fors".* FROM "applied_fors" WHERE "applied_fors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "applied_fors" SET "status" = ?, "updated_at" = ? WHERE "applied_fors"."id" = ?  [["status", 2], ["updated_at", "2021-11-24 19:11:51.037167"], ["id", 1]]

    def show
        @job = Job.find(params[:job_id])
        @user = User.find(session[:user_id])
        @applied_for = AppliedFor.find(params[:id])
        @applied_for.status = "3"
        if @applied_for.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "applied_fors".* FROM "applied_fors" WHERE "applied_fors"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
UPDATE "applied_fors" SET "status" = ?, "updated_at" = ? WHERE "applied_fors"."id" = ?  [["status", 3], ["updated_at", "2021-11-25 14:56:36.489476"], ["id", 19]]