app/controllers/job_controller.rb

    def show
        @user = User.find_by(params[:user_id])
---
SELECT "users".* FROM "users" WHERE (#<Job::ActiveRecord_Relation:0x00007ff64e951b80>) LIMIT ?  [["LIMIT", 1]]