app/controllers/jobs_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "jseekers".* FROM "jseekers" WHERE "jseekers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "applied_fors".* FROM "applied_fors" WHERE "applied_fors"."job_id" = ?  [["job_id", 1]]
SELECT "jseekers".* FROM "jseekers" WHERE "jseekers"."id" = ?  [["id", 1]]
---
    def show
        @user = User.find(params[:user_id])
        #@job=@user.jobs.find_by(params[:id])
        @job= Job.find(params[:id])
        Current.jseeker = Jseeker.find_by(id:session[:jseeker_id])
        if Current.jseeker
          @jseeker = Jseeker.find(session[:jseeker_id])
        end
        Current.user = User.find_by(id:session[:user_id])
        if Current.user
        @a = AppliedFor.where(job_id: @job.id)
        @js = []
        @a.each do |b|
            tjs = Jseeker.where(id: b.jseeker_id)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def create
        @user = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def destroy
      @job = Job.find(params[:id])
      @job.destroy
      @user = User.find(session[:user_id])