app/controllers/jseeker_controller.rb

    def create
        #params
     #  @user= User.new(params[:user])
      # User.new(email: "bob@bob", password: "password")
       # render plain: params[:user]
        @jseeker = Jseeker.new(jseeker_params)
        if @jseeker.save
---
INSERT INTO "jseekers" ("name", "mobile", "email", "percentage", "created_at", "updated_at", "password_digest", "qdegree", "jdes") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def status
        @jseeker = Jseeker.find(session[:jseeker_id])
        @a = AppliedFor.where(jseeker_id: @jseeker.id)
        @job = []
        @a.each do |b|
---
SELECT "jseekers".* FROM "jseekers" WHERE "jseekers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "applied_fors".* FROM "applied_fors" WHERE "applied_fors"."jseeker_id" = ?  [["jseeker_id", 7]]

    def show
        @jobs = Job.all
        @jseeker = Jseeker.find(params[:id])
---
SELECT "jseekers".* FROM "jseekers" WHERE "jseekers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]