app/controllers/main_controller.rb

    def index
        @jseeker = Jseeker.find_by(id:session[:jseeker_id])
        @user = User.find_by(id:session[:user_id])
---
SELECT "jseekers".* FROM "jseekers" WHERE "jseekers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]