app/controllers/password_resets1_controller.rb

SELECT "jseekers".* FROM "jseekers" WHERE "jseekers"."email" = ? LIMIT ?  [["email", "aljfdlajaf@gmail.com"], ["LIMIT", 1]]
---
    def create
        @jseeker = Jseeker.find_by(email: params[:email])