app/controllers/sessions_controller.rb

    def create
        #user=User.find_by(email: params[:email])
        user=User.find_by(mobileno: params[:mobileno])
---
SELECT "users".* FROM "users" WHERE "users"."mobileno" = ? LIMIT ?  [["mobileno", "aws01@gmail.com"], ["LIMIT", 1]]