app/controllers/sessions1_controller.rb

    def new
        if Jseeker.find_by(id:session[:jseeker_id])
---
SELECT "jseekers".* FROM "jseekers" WHERE "jseekers"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

    def create


        #jseeker=Jseeker.find_by(email: params[:email])
        jseeker=Jseeker.find_by(mobile: params[:mobile])
---
SELECT "jseekers".* FROM "jseekers" WHERE "jseekers"."mobile" = ? LIMIT ?  [["mobile", "890123457890"], ["LIMIT", 1]]