app/controllers/users_controller.rb

    def create
        channel = user_params['channel']
        #params
     #  @user= User.new(params[:user])
      # User.new(email: "bob@bob", password: "password")
       # render plain: params[:user]
       @user = User.new(user_params.except('channel', 'displayed_phone_number'))
        if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "cname", "cinumber", "mobileno") VALUES (?, ?, ?, ?, ?, ?, ?)